# PlacementCenterX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlacementCenterX Property
ParameterTypeId Class See Also
---
"Center X"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlacementCenterX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlacementCenterX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlacementCenterX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace